package Lesson13;

public class Task5 {

    public static void main(String[] args) {

    }
}

//не успел, постараюсь завтра до урока прислать, если получится решить.

//5*)со звездочкой! В метод на вход приходит строка
//        *
//        *  public static boolean validate(String str) {
//        return false;
//        }
//        * Необходимо выполнить проверку на валидацию входящей строки и вернуть false или true
//        * - Строка должна содержать только маленькие латинские буквы и цифры 1 или 5 без знака подчеркивания.
//        * - Длина строки должна быть от 4 до 20 символов.
//        *
//        * PS: нужно посмотреть презентацию страница 44 (Метасимволы для группировки символов)
